<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [81]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [82]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [83]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [84]:
!pip install -q pandas==1.1.5

In [85]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [86]:
import pandas as pd

df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [87]:
output=pd.read_sql('select distinct Launch_Site from SPACEXTBL',con)
output

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40
4          None


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [88]:
output1=pd.read_sql('select * from SPACEXTBL where Launch_Site like \'CCA%\'limit 5', con)
output1

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,06/04/2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0.0,LEO,SpaceX,Success,Failure (parachute)
1,12/08/2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0.0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22/05/2012,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525.0,LEO (ISS),NASA (COTS),Success,No attempt
3,10/08/2012,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500.0,LEO (ISS),NASA (CRS),Success,No attempt
4,03/01/2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677.0,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [89]:
output3=pd.read_sql('select Customer, sum(PAYLOAD_MASS__KG_) from SPACEXTBL group by Customer having Customer=\'NASA (CRS)\'', con)
output3

     Customer  sum(PAYLOAD_MASS__KG_)
0  NASA (CRS)                 45596.0

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [90]:
output4= pd.read_sql('select Booster_Version, avg(PAYLOAD_MASS__KG_) from SPACEXTBL group by Booster_Version having Booster_Version like \'F9 v1.1\'', con)
output4

  Booster_Version  avg(PAYLOAD_MASS__KG_)
0         F9 v1.1                  2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [99]:
output5=pd.read_sql('select min(substr(Date,7,4)), Date, Landing_Outcome from SPACEXTBL where Landing_Outcome=\'Success (ground pad)\'', con)
output5

  min(substr(Date,7,4))        Date       Landing_Outcome
0                  2015  22/12/2015  Success (ground pad)

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [94]:
output6=pd.read_sql('select Booster_Version, Landing_Outcome,PAYLOAD_MASS__KG_ from SPACEXTBL where Landing_Outcome=\'Success (drone ship)\' and PAYLOAD_MASS__KG_> 4000.0 and PAYLOAD_MASS__KG_<6000.0', con)
output6
#and PAYLOAD_MASS__KG_> 4000.0 and PAYLOAD_MASS__KG_>6000.0\

  Booster_Version       Landing_Outcome  PAYLOAD_MASS__KG_
0     F9 FT B1022  Success (drone ship)             4696.0
1     F9 FT B1026  Success (drone ship)             4600.0
2  F9 FT  B1021.2  Success (drone ship)             5300.0
3  F9 FT  B1031.2  Success (drone ship)             5200.0

### Task 7




##### List the total number of successful and failure mission outcomes

In [95]:
output7=pd.read_sql('select Mission_Outcome, count(*) as Total from SPACEXTBL where Mission_Outcome like \'Success%\' or Mission_Outcome like \'Failure%\' group by Mission_Outcome', con)
output7

                    Mission_Outcome  Total
0               Failure (in flight)      1
1                           Success     98
2                          Success       1
3  Success (payload status unclear)      1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [96]:
output8=pd.read_sql('select booster_version, PAYLOAD_MASS__KG_ from SPACEXTBL where PAYLOAD_MASS__KG_=(select max(PAYLOAD_MASS__KG_) from SPACEXTBL) order by PAYLOAD_MASS__KG_ desc', con)
output8

   Booster_Version  PAYLOAD_MASS__KG_
0    F9 B5 B1048.4            15600.0
1    F9 B5 B1049.4            15600.0
2    F9 B5 B1051.3            15600.0
3    F9 B5 B1056.4            15600.0
4    F9 B5 B1048.5            15600.0
5    F9 B5 B1051.4            15600.0
6    F9 B5 B1049.5            15600.0
7   F9 B5 B1060.2             15600.0
8   F9 B5 B1058.3             15600.0
9    F9 B5 B1051.6            15600.0
10   F9 B5 B1060.3            15600.0
11  F9 B5 B1049.7             15600.0

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [100]:
output9=pd.read_sql('select substr(Date, 4, 2) as Months,Landing_Outcome,booster_version, launch_site  from SPACEXTBL where landing_outcome=\'Failure (drone ship)\' and substr(Date,7,4)=\'2015\'', con)
output9

  Months       Landing_Outcome Booster_Version  Launch_Site
0     10  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1     04  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [101]:
output10=pd.read_sql('select count(*) as Count_of_Successful_Landing, landing_outcome from SPACEXTBL where landing_outcome like \'Success%\' group by landing_outcome order by 1 desc', con)
output10

   Count_of_Successful_Landing       Landing_Outcome
0                           38               Success
1                           14  Success (drone ship)
2                            9  Success (ground pad)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>